---
kind: type
id: T:Autodesk.Revit.DB.UnderlayOrientation
source: html/62de257b-9b27-9a43-a15d-a3dba5c87e16.htm
---
# Autodesk.Revit.DB.UnderlayOrientation

Indicates how elements in the underlay are viewed.

## Syntax (C#)
```csharp
public enum UnderlayOrientation
```